# -*- coding: utf-8 -*
import urllib
import urllib.request
from bs4 import BeautifulSoup
# 通过角色名抓取图片url
name_list = ['骑士圣女贞德','武士须佐能乎','魔王薇薇安','蒙泰量产型','剑道社长香织','驱魔人亚伯','勇士乌兹门特','捕快卞剑秀','暴走伊莎贝尔','精忠报国郑成功','战场之维多利亚','苦恼的莱昂内尔','不眠的娅莉塔','僵尸希恩','天师钟馗','黑暗领导博格斯','火之愤怒莎莎','魔剑士伊西丝','斗士哈尔菲亚','寒冷托尔','国王亚历山大','英雄阿基里斯','德雷克船长','暗黑贝恩','恶魔该隐','破坏者斯黛拉','乙支文德','V-追踪型','忠实的赫克托尔','圣斗士雅典娜','梦中的齐格弗里德','铁皮骑士杜尔拉汗','红色鲁格斯','酋长沃尔夫冈','隐遁的芬里尔','料理师雷玲','帝师修尔拉','野兽之灵·坤','迅雷半藏','义贼罗宾汉','R-1','月半奇波郎','一箭双雕小光','寒霜幽灵妮芬','金枝玉叶春香','卓越的麦格尼斯','追击者阿塔兰特','绿曼巴','舞蹈家李','鹰之眼拉喜玛','幽灵之友贝欧琳','公主辉夜姬','复仇者凯伦','灾难塞特','心眼韩胜','女汉子梅西','军官斯派洛','佣兵斯内克','绅士乌鸦','复仇者文森特','魔弹射手No.9','哨兵A','见习英雄明蒂','暗夜猎手威廉','晓之孙市','变装女仆迪雅','夏洛克德斯','代号斯佩妮','考古学家罗蕾莱','妮欧（五星）','梅尔（五星）','蕾拉（五星）','海盗猎手斯嘉丽','怪人雷芬','寒门桃太郎','行刑者鲁伊希尔拉','火枪队阿索斯','迷之雅甘','死神代行桂香','霜之哀伤萨斯夸奇','黑夜女王莉莉丝','魅魔瑞秋','女王爱丽丝','和谐的纳兹伦','秀才李梦龙','亡灵武士内克伦','点石成金德米特尔','审判官乌列','怪盗路尼昂','研究者宾森恩','隐居者贝斯派','傀儡师贝萝特','月之火伊吹','超脱的海獭','团长乌尔弗兰姆','探索者奥西里斯','猫女喵','救死扶伤南丁格尔','秀外慧中阿狸','危险的特工护士','伟大的乌帕','巫女卑弥呼','偏执的斯坦因','美食家彩依','顿悟的达拉','黄金的贝阿朵莉切','傲慢的奥菲欧','占卦师娅莉娅','革命军尤莉娅','禁戒的福斯特','疾风怒涛赛莲','圣都骑士诺埃尔','旅行家瓦莉','阴阳道晴明','预知梦墨菲斯']
for name in name_list:
     response = urllib.request.urlopen('http://wiki.joyme.com/cq/'+urllib.parse.quote(name))
     html = response.read()
     res = BeautifulSoup(html,"html.parser")
     for tag1 in res.find_all('div', class_='hero-info-image'):
          r_name = tag1.find('img').get('src')
          with open("result_image_url.txt","a") as file:
               file.write(r_name+'\n')
     print(name+" success")